app/Controllers/Api.php

    public function dishCategory(int $categoryID = null): ResponseInterface
    {
        $model = new DishCategoryModel();

        if ($this->request->getMethod() === 'POST') {
            if($_POST) {
                $categoryID = $_POST['CategoryID'];
                $categoryName = $_POST['CategoryName'];
                $restaurantID = $_POST['RestaurantID'];

                try {
                    if ($categoryID) {      //update
                        $model->update($categoryID, ['CategoryName' => $categoryName]);
                        return $this->response->setJSON(['status' => 200, 'message' => 'Dish Category updated successfully']);
                    } else {                // insert
                        $model->insert([
                            'RestaurantID' => $restaurantID,
                            'CategoryName' => $categoryName]);
                        $addedData = $model->where('RestaurantID', $restaurantID)->where('CategoryName', $categoryName)->first();
---
INSERT INTO `DISH_CATEGORIES` (`RestaurantID`, `CategoryName`) VALUES ('11', 'Dim Sum')
SELECT *
FROM `DISH_CATEGORIES`
WHERE `RestaurantID` = '11'
AND `CategoryName` = 'Dim Sum'
 LIMIT 1

    public function getAllDishCategory(int $restaurantID = null): ResponseInterface
    {
        if ($restaurantID === null) {
            return $this->response->setStatusCode(404, 'Not Found');
        }

        $dishCategoryModel = new DishCategoryModel();
        $categories = $dishCategoryModel->where('RestaurantID', $restaurantID)->orderBy('CategoryName', 'ASC')->findAll();
---
SELECT *
FROM `DISH_CATEGORIES`
WHERE `RestaurantID` = 11
ORDER BY `CategoryName` ASC

    public function customisationOption(int $optionID = null): ResponseInterface
    {
        $db = \Config\Database::connect();
        $dataProcessor = new DataProcessor();
        $customisationOptionModel = new CustomisationOptionModel();
        $optionValueModel = new OptionValueModel();
        if ($this->request->getMethod() === 'POST') {
            $json = $this->request->getJSON();

            // Handle Option
            $optionID = $json->Option->OptionID;
            $optionName =  $json->Option->OptionName;
            $restaurantID = $json->Option->RestaurantID;

            try {
                if ($optionID) {  // update
                    $customisationOptionModel->update($optionID, ['OptionName' => $optionName]);
                } else {          // insert
                    $optionID = $customisationOptionModel->insert([
                        'RestaurantID' => $restaurantID,
                        'OptionName' => $optionName
                    ]);
---
INSERT INTO `CUSTOMISATION_OPTIONS` (`RestaurantID`, `OptionName`) VALUES (11, 'Soy Sauce')

            }

            // Handle Values
            $existingValues = $optionValueModel->where('OptionID', $optionID)->findAll();
---
SELECT *
FROM `OPTION_VALUES`
WHERE `OptionID` = 5

                ];

                // Try update, if not exists, insert
                $existingValue = $optionValueModel->where(['OptionID' => $optionID, 'ValueName' => $value->ValueName])->first();
                if ($existingValue) {
                    $optionValueModel->update($existingValue['ValueID'], $valueData);
                } else {
                    $optionValueModel->insert($valueData);
---
SELECT *
FROM `OPTION_VALUES`
WHERE `OptionID` = 5
AND `ValueName` = 'Regular'
 LIMIT 1
INSERT INTO `OPTION_VALUES` (`OptionID`, `ValueName`, `ExtraPrice`) VALUES (5, 'Regular', '111')

            return $this->response->setJSON(['status' => 200, 'message' => 'Customisation option processed successfully', 'data' => $response]);
        } else {
            $response['Option'] = $customisationOptionModel->find($optionID);
            $response['Values'] = $optionValueModel->where('OptionID', $optionID)->findAll();
---
SELECT *
FROM `OPTION_VALUES`
WHERE `OptionID` IS NULL

    public function getAllCustomisationOptions(int $restaurantID = null): ResponseInterface
    {
        $customisationOptionModel = new customisationOptionModel();
        $response['data'] = $customisationOptionModel->where('RestaurantID', $restaurantID)->orderBy('OptionName', 'ASC')->findAll();
---
SELECT *
FROM `CUSTOMISATION_OPTIONS`
WHERE `RestaurantID` = 11
ORDER BY `OptionName` ASC

    public function dish(int $dishID = null): ResponseInterface
    {
        $dataProcessor = new DataProcessor();
        $db = \Config\Database::connect();
        $dishModel = new DishModel();
        $dishAvailableOptionModel = new DishAvailableOptionModel();

        if ($this->request->getMethod() === 'POST') {
            if ($_POST) {
                $restaurantID = $this->request->getPost('RestaurantID');
                $dishID = $this->request->getPost('DishID');
                $categoryID = $this->request->getPost('CategoryID');
                $description = $this->request->getPost('Description');
                $dishName = $this->request->getPost('DishName');
                $basePrice = $this->request->getPost('BasePrice');
                $optionIDs = $this->request->getPost('OptionIDs');

                try {
                    if ($dishID) {
                        // update if dishID exists
                        $dishModel->update($dishID, [
                            'CategoryID' => $categoryID,
                            'Description' => $description,
                            'BasePrice' => $basePrice,
                            'DishName' => $dishName,
                        ]);
                    } else {
                        // insert if dishID not exists
                        $dishID = $dishModel->insert([
                            'CategoryID' => $categoryID,
                            'Description' => $description,
                            'BasePrice' => $basePrice,
                            'DishName' => $dishName,
                        ]);
                    }

                    // before reinsert all available options, delete all existing options
                    $dishAvailableOptionModel->where('DishID', $dishID)->delete();
---
INSERT INTO `DISHES` (`CategoryID`, `Description`, `BasePrice`, `DishName`) VALUES ('12', 'qqq', 'qqq', 'Latee')
DELETE FROM `DISH_AVAILABLE_OPTIONS`
WHERE `DishID` = 7

    public function table(int $tableID = null): ResponseInterface
    {
        $model = new TableModel();

        if ($this->request->getMethod() === 'POST') {
            if ($_POST) {
                $restaurantID = $this->request->getPost('RestaurantID');
                $tableNumber = $this->request->getPost('TableNumber');
                $tableCapacity = $this->request->getPost('Capacity');
                $tableID = $this->request->getPost('TableID');

                try {
                    if ($tableID) {      //update
                        $model->update($tableID, [
                            'TableNumber' => $tableNumber,
                            'Capacity' => $tableCapacity
                        ]);
                    } else {                // insert
                        $tableID = $model->insert([
                            'RestaurantID' => $restaurantID,
                            'TableNumber' => $tableNumber,
                            'Capacity' => $tableCapacity
                        ]);
---
INSERT INTO `TABLES` (`RestaurantID`, `TableNumber`, `Capacity`) VALUES ('11', '1', '0')