app/Controllers/DataProcessor.php

    public function customisationOptionForWebView(int $restaurantID = null, int $optionID = null): array
    {
        $db = Database::connect();

        if (!$optionID) {
            $query = $db->table('CUSTOMISATION_OPTIONS as C')
                ->select('C.OptionID, C.OptionName, C.RestaurantID, O.ValueID, O.ValueName, O.ExtraPrice')
                ->join('OPTION_VALUES as O', 'O.OptionID = C.OptionID', 'left')
                ->where('C.RestaurantID', $restaurantID)
                ->orderBy('C.OptionName', 'ASC')
                ->orderBy('O.ValueName', 'ASC');
        } else {
            $query = $db->table('CUSTOMISATION_OPTIONS as C')
                ->select('C.OptionID, C.OptionName, C.RestaurantID, O.ValueID, O.ValueName, O.ExtraPrice')
                ->join('OPTION_VALUES as O', 'O.OptionID = C.OptionID', 'left')
                ->where('C.OptionID', $optionID)
                ->orderBy('O.ValueName', 'ASC');
        }

        $customisationOptions = $query->get()->getResultArray();
---
SELECT `C`.`OptionID`, `C`.`OptionName`, `C`.`RestaurantID`, `O`.`ValueID`, `O`.`ValueName`, `O`.`ExtraPrice`
FROM `CUSTOMISATION_OPTIONS` as `C`
LEFT JOIN `OPTION_VALUES` as `O` ON `O`.`OptionID` = `C`.`OptionID`
WHERE `C`.`RestaurantID` = 11
ORDER BY `C`.`OptionName` ASC, `O`.`ValueName` ASC

    public function dishForWebView(int $restaurantID = null, int $dishID = null): array
    {
        $db = Database::connect();
        if (!$dishID) {
            $query = $db->table('DISHES as DI')
                ->select('DC.RestaurantID, DC.CategoryID, DC.CategoryName, DI.DishID, DI.DishName, DI.Description, DI.BasePrice, DAO.OptionID, CO.OptionName')
                ->join('DISH_CATEGORIES as DC', 'DI.CategoryID = DC.CategoryID', 'inner')
                ->join('DISH_AVAILABLE_OPTIONS as DAO', 'DI.DishID = DAO.DishID', 'left')
                ->join('CUSTOMISATION_OPTIONS as CO', 'DAO.OptionID = CO.OptionID', 'left')
                ->where('DC.RestaurantID', $restaurantID)
                ->orderBy('DishName','ASC');
        } else {
            $query = $db->table('DISHES as DI')
                ->select('DC.RestaurantID, DC.CategoryID, DC.CategoryName, DI.DishID, DI.DishName, DI.Description, DI.BasePrice, DAO.OptionID, CO.OptionName')
                ->join('DISH_CATEGORIES as DC', 'DI.CategoryID = DC.CategoryID', 'inner')
                ->join('DISH_AVAILABLE_OPTIONS as DAO', 'DI.DishID = DAO.DishID', 'left')
                ->join('CUSTOMISATION_OPTIONS as CO', 'DAO.OptionID = CO.OptionID', 'left')
                ->where('DC.RestaurantID', $restaurantID)
                ->where('DI.DishID', $dishID);
        }

        $dishes = $query->get()->getResultArray();
---
SELECT `DC`.`RestaurantID`, `DC`.`CategoryID`, `DC`.`CategoryName`, `DI`.`DishID`, `DI`.`DishName`, `DI`.`Description`, `DI`.`BasePrice`, `DAO`.`OptionID`, `CO`.`OptionName`
FROM `DISHES` as `DI`
INNER JOIN `DISH_CATEGORIES` as `DC` ON `DI`.`CategoryID` = `DC`.`CategoryID`
LEFT JOIN `DISH_AVAILABLE_OPTIONS` as `DAO` ON `DI`.`DishID` = `DAO`.`DishID`
LEFT JOIN `CUSTOMISATION_OPTIONS` as `CO` ON `DAO`.`OptionID` = `CO`.`OptionID`
WHERE `DC`.`RestaurantID` = 11
ORDER BY `DishName` ASC