app/Controllers/ProjectController.php

SELECT *
FROM `RESTAURANTS`
WHERE `RESTAURANTS`.`RestaurantID` = '11'
SELECT *
FROM `TABLES`
WHERE `TableNumber` = '1'
AND `RestaurantID` = '11'
 LIMIT 1
---
    public function restaurant(int $restaurantID): string
    {
        $dataProcessor = new DataProcessor();
        $restaurantModel = new RestaurantModel();
        $dishCategoryModel = new DishCategoryModel();
        $tableModel = new TableModel();

        // Fetch user details by user_id
        $data['restaurant'] = $restaurantModel->find($restaurantID);

        // Ensure user exists
        if (!$data['restaurant']) {
            throw new PageNotFoundException('Restaurant Not Found');
        }

        // Fetch related data
        $data['dishCategories'] = $dishCategoryModel->where('RestaurantID', $restaurantID)->orderBy('CategoryName', 'ASC')->findAll();

        // Dish Info
        $mergedDishes = $dataProcessor->dishForWebView($restaurantID, null);
        $data['dishes'] = $mergedDishes;

        // Customisation Info
        $mergedCustomisationOptions = $dataProcessor->customisationOptionForWebView($restaurantID, null);
        $data['customisationOptions'] = $mergedCustomisationOptions;

        // Table Info
        $data['tables'] = $tableModel->where('RestaurantID', $restaurantID)->orderBy('TableNumber', 'ASC')->findAll();